# Homework 1

## Configuración inicial
    * Instalar Docker y desplegar un contenedor con PostgreSQL.

    * Crear una base de datos llamada supermercado_db.

    - Al inicializar el proyecto se crea automaticamente la base de datos mediante [`script`](./MOD2/LECTURE1/scripts/01_init_db.sql) con el siguiente comando 

    ```sql
    DROP DATABASE IF EXISTS market_db;
    CREATE DATABASE market_db;
    USE market_db;

# Homework 2

## Modelado de Datos
Crear las siguientes tablas con relaciones:

productos (id, nombre, categoría, precio, stock, sucursal_id)

sucursales (id, nombre, ubicación)

clientes (id, nombre, email, fecha_registro)

ventas (id, cliente_id, producto_id, fecha_venta, cantidad, total)

Definir claves primarias (PK), foráneas (FK) y restricciones (ON DELETE CASCADE/SET NULL).

   - Al igual que en el punto previo, la tablas se crean al inicializar el proyecto[`script`](./MOD2/LECTURE1/scripts/01_init_db.sql) con las siguientes instrucciones: 

    ```sql
    CREATE TABLE products (
    id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(100) NOT NULL,
    category VARCHAR(50) NOT NULL,
    price DECIMAL(10, 2) NOT NULL,
    stock INT NOT NULL,
    branch_id INT,
    FOREIGN KEY (branch_id) REFERENCES branchs(id) ON DELETE SET NULL
    );

    -- sucursales
    CREATE TABLE branchs (
        id INT AUTO_INCREMENT PRIMARY KEY,
        name VARCHAR(100) NOT NULL,
        location VARCHAR(255) NOT NULL
    );

    -- clientes
    CREATE TABLE customers (
        id INT AUTO_INCREMENT PRIMARY KEY,
        name VARCHAR(100) NOT NULL,
        email VARCHAR(100) NOT NULL UNIQUE,
        registration_date DATE NOT NULL
    );
    -- tabla ventas
    CREATE TABLE sales (
        id INT AUTO_INCREMENT PRIMARY KEY,
        customer_id INT,
        product_id INT,
        sale_date DATE NOT NULL,
        quantity INT NOT NULL,
        total DECIMAL(10, 2) NOT NULL,
        FOREIGN KEY (customer_id) REFERENCES customers(id) ON DELETE CASCADE SET NULL,
        FOREIGN KEY (product_id) REFERENCES products(id) ON DELETE CASCADE SET NULL
    );
    ```

   product_id            product_name  total_quantity
0         179           Yoghurt Tubes        199724.0
1         161  Longos - Chicken Wings        199659.0
2          47    Thyme - Lemon; Fresh        198567.0
3         280            Onion Powder        198163.0
4         103         Cream Of Tartar        198126.0

,product_id,product_name,seller_id,total_sold,seller_name,seller_quantity
0,47,Thyme - Lemon; Fresh,21,198567.0,Devon Brewer,11050.0
1,161,Longos - Chicken Wings,10,199659.0,Jean Vang,10785.0
2,280,Onion Powder,21,198163.0,Devon Brewer,10570.0
3,103,Cream Of Tartar,11,198126.0,Sonya Dickson,10348.0
4,179,Yoghurt Tubes,9,199724.0,Daphne King,10285.0

,product_id,product_name,unique_customers,total_customers,proportion_percentage
0,161,Longos - Chicken Wings,14252,98759,14.43
1,103,Cream Of Tartar,14246,98759,14.43
2,47,Thyme - Lemon; Fresh,14101,98759,14.28
3,179,Yoghurt Tubes,14066,98759,14.24
4,280,Onion Powder,14058,98759,14.23

,product_id,product_name,category_name,total_quantity,total_category_quantity,category_percentage
0,179,Yoghurt Tubes,Seafood,199724.0,6996142.0,2.85
1,161,Longos - Chicken Wings,Snails,199659.0,7199358.0,2.77
2,280,Onion Powder,Beverages,198163.0,7393693.0,2.68
3,47,Thyme - Lemon; Fresh,Poultry,198567.0,9159792.0,2.17
4,103,Cream Of Tartar,Meat,198126.0,9719274.0,2.04

,product_id,product_name,category_name,total_quantity,category_rank
0,179,Yoghurt Tubes,Seafood,199724.0,1
1,161,Longos - Chicken Wings,Snails,199659.0,1
2,47,Thyme - Lemon; Fresh,Poultry,198567.0,1
3,280,Onion Powder,Beverages,198163.0,1
4,103,Cream Of Tartar,Meat,198126.0,1
5,39,Dried Figs,Produce,198032.0,1
6,324,Apricots - Dried,Snails,198032.0,2
7,319,Towels - Paper / Kraft,Meat,198005.0,2
8,425,Wine - Redchard Merritt,Dairy,197969.0,1
9,184,Hersey Shakes,Poultry,197942.0,2

# Homework 3
## Operaciones CRUD
Insertar 10 registros en cada tabla.

Realizar consultas con JOIN para mostrar los productos vendidos por sucursal y por cliente.

Actualizar precios de productos por categoría.

Eliminar registros de ventas usando transacciones (BEGIN, COMMIT, ROLLBACK).

In [3]:
import utils.postgres_utils as postgres_utils

df = postgres_utils.run_query("SELECT * FROM sales LIMIT 10;")
df.head()

   id  customer_id  product_id   sale_date  quantity  total
0   3            3           3  2021-03-10         3  23.97
1   4            4           4  2023-04-20         1  12.99
2   6            6           6  2020-06-30         2  29.98
3   7            7           7  2020-06-30         1  11.49
4   8            8           8  2022-06-30         5  44.95

In [4]:
# inserrtar 10 registros en la tabla products
from data.fixtures import branches,products, customers, sales
from models.branches import Branch
from models.products import Product
from models.customers import Customer
from models.sales import Sale

import utils.postgres_utils as postgres_utils


# lista(zip(nombres, valores))
# Resultado: [('name', 'Sucursal 1'), ('location', 'Direccion 1')]

# diccionario = dict(Resultado)

# diccionario = {'name': 'Sucursal 1', 'location': 'Direccion 1'}

# branch_records = [dict(zip(["name", "location"], branch)) for branch in branches]
# product_records = [dict(zip(["name", "category", "price", "stock", "branch_id"], product)) for product in products]
Branch.bulk_insert(Branch.set_from_rows(branches))
Product.bulk_insert(Product.set_from_rows(products))
Customer.bulk_insert(Customer.set_from_rows(customers))
Sale.bulk_insert(Sale.set_from_rows(sales))

Branch bulk inserted successfully.
Product bulk inserted successfully.
Customer bulk inserted successfully.
Sale bulk inserted successfully.

* Realizar consultas con JOIN para mostrar los productos vendidos por sucursal y por cliente

In [5]:
import utils.postgres_utils as postgres_utils

query = """
SELECT customers.name AS name, products.name AS product , sale_date, quantity, total, branches.name AS branch
FROM sales s
JOIN customers ON s.customer_id = customers.id
JOIN products ON s.product_id = products.id
JOIN branches ON products.branch_id = branches.id
ORDER BY customers.name, sale_date DESC
"""

print("Sales Report:")
postgres_utils.run_query(query)

Sales Report:

       name     product   sale_date  quantity   total      branch
0       Ale  Producto J  2024-08-30         3   50.97  Sucursal 3
1       Ale  Producto J  2024-08-30         3   50.97  Sucursal 3
2      Axel  Producto F  2020-06-30         2   29.98  Sucursal 1
3      Axel  Producto F  2020-06-30         2   29.98  Sucursal 1
4    Carlos  Producto H  2022-06-30         5   44.95  Sucursal 2
5    Carlos  Producto H  2022-06-30         5   44.95  Sucursal 2
6   Gerardo  Producto H  2025-06-26         5   44.95  Sucursal 2
7   Gerardo  Producto H  2025-06-26         5  225.00  Sucursal 2
8   Gerardo  Producto H  2025-06-26         5  225.00  Sucursal 2
9   Gerardo  Producto B  2023-02-15         1   15.49  Sucursal 2
10  Gerardo  Producto A  2023-01-01         2   21.98  Sucursal 1
11  Gerardo  Producto E  2022-05-05         4   37.96  Sucursal 2
12  Gustavo  Producto D  2023-04-20         1   12.99  Sucursal 3
13  Gustavo  Producto D  2023-04-20         1   12.99  Sucursal 3
14     Juan  Producto C  2021-03-10         3   23.97  Sucursal 1
15     Juan  Producto C  2021-03-10         3   23.97  Sucursal 1
16   Luciaa  Producto I  2024-08-18         2   26.98  Sucursal 1
17   Luciaa  Producto I  2024-08-18         2   26.98  Sucursal 1
18    Molko  Producto G  2020-06-30         1   11.49  Sucursal 3
19    Molko  Producto G  2020-06-30         1   11.49  Sucursal 3

* Actualizar precios de productos por categoría.

In [6]:

from models.products import Product


Product.update_product_prices("Categoria 1", 10)

* Eliminar registros de ventas usando transacciones (BEGIN, COMMIT, ROLLBACK).

In [7]:
import utils.postgres_utils as pg_utils

query = """
SELECT * FROM sales
"""
print("Sales before deletion:")
pg_utils.run_query(query)

Sales before deletion:

    id  customer_id  product_id   sale_date  quantity   total
0    3            3           3  2021-03-10         3   23.97
1    4            4           4  2023-04-20         1   12.99
2    6            6           6  2020-06-30         2   29.98
3    7            7           7  2020-06-30         1   11.49
4    8            8           8  2022-06-30         5   44.95
5    9            9           9  2024-08-18         2   26.98
6   10           10          10  2024-08-30         3   50.97
7   11            1           8  2025-06-26         5  225.00
8   12            1           8  2025-06-26         5  225.00
9   13            1           8  2025-06-26         5   44.95
10  14            1           1  2023-01-01         2   21.98
11  15            1           2  2023-02-15         1   15.49
12  16            3           3  2021-03-10         3   23.97
13  17            4           4  2023-04-20         1   12.99
14  18            1           5  2022-05-05         4   37.96
15  19            6           6  2020-06-30         2   29.98
16  20            7           7  2020-06-30         1   11.49
17  21            8           8  2022-06-30         5   44.95
18  22            9           9  2024-08-18         2   26.98
19  23           10          10  2024-08-30         3   50.97

In [8]:
import utils.postgres_utils as pg_utils
from models.sales import Sale

Sale.delete_by_customer(1)

print("Sales after deletion:")
query = """
SELECT * FROM sales
"""
print("Sales before deletion:")
pg_utils.run_query(query)

Deleted sales for customer ID 1.
Sales after deletion:
Sales before deletion:

    id  customer_id  product_id   sale_date  quantity  total
0    3            3           3  2021-03-10         3  23.97
1    4            4           4  2023-04-20         1  12.99
2    6            6           6  2020-06-30         2  29.98
3    7            7           7  2020-06-30         1  11.49
4    8            8           8  2022-06-30         5  44.95
5    9            9           9  2024-08-18         2  26.98
6   10           10          10  2024-08-30         3  50.97
7   16            3           3  2021-03-10         3  23.97
8   17            4           4  2023-04-20         1  12.99
9   19            6           6  2020-06-30         2  29.98
10  20            7           7  2020-06-30         1  11.49
11  21            8           8  2022-06-30         5  44.95
12  22            9           9  2024-08-18         2  26.98
13  23           10          10  2024-08-30         3  50.97

# Homework 4

## Optimización
* Crear índices en columnas frecuentemente consultadas (ej: email en clientes, nombre en productos).

Usar EXPLAIN ANALYZE para comparar el rendimiento antes/después de los índices.

In [9]:
email_to_search = 'gera@mail.com'

query = f"""
    SELECT * FROM customers
    WHERE email ILIKE '%{email_to_search}%'
    """

print(f"Searching for customer with email: {email_to_search}")
postgres_utils.run_query(query=query)

Searching for customer with email: gera@mail.com

   id     name          email registration_date
0   1  Gerardo  gera@mail.com        2023-01-01
1  11  Gerardo  gera@mail.com        2023-01-01

Resultado Query cliente por email antes del index 

![image](assets/img-query-email_before_index.png)

In [10]:
from models.customers import Customer
Customer.create_index(index_name='idx_customers_email',columns=['email'])

Index 'idx_customers_email' created successfully on 'customers'.

Resultado Query cliente por email luego del index . 
Se reduce nueve veces el tiempo de ejecución

![image.png](assets/query-plan.png)
<br/>
<br/>
<br/>

![image.png](assets/analyze.png)

# HW 5
## Automatización

* Crear un trigger que actualice el stock automáticamente al realizar una venta.

In [11]:
from models.sales_triggers import SalesTriggers
SalesTriggers.create_stock_update_trigger()

Error: trigger "trg_update_stock_after_sale" for relation "sales" already exists

[SalesTriggers] Trigger created successfully.

- Insert de nueva venta

In [12]:
from utils.postgres_utils import run_query

query ="""SELECT * FROM products"""

print("Select before sale to check stock")

run_query(query=query)

Select before sale to check stock

    id        name     category  price  stock  branch_id
0   12  Producto B  Categoria 2  15.49     50          2
1   14  Producto D  Categoria 3  12.99     75          3
2   15  Producto E  Categoria 2   9.49    120          2
3   17  Producto G  Categoria 3  11.49     60          3
4   18  Producto H  Categoria 2   8.99     90          2
5   20  Producto J  Categoria 3  16.99     40          3
6    2  Producto B  Categoria 2  15.49     49          2
7    4  Producto D  Categoria 3  12.99     74          3
8    5  Producto E  Categoria 2   9.49    116          2
9    7  Producto G  Categoria 3  11.49     59          3
10   8  Producto H  Categoria 2   8.99     70          2
11  10  Producto J  Categoria 3  16.99     37          3
12  11  Producto A  Categoria 1  12.09    100          1
13  13  Producto C  Categoria 1   8.79    200          1
14  16  Producto F  Categoria 1  16.49     80          1
15  19  Producto I  Categoria 1  14.84    110          1
16   1  Producto A  Categoria 1  16.09     98          1
17   3  Producto C  Categoria 1  11.70    197          1
18   6  Producto F  Categoria 1  21.95     78          1
19   9  Producto I  Categoria 1  19.75    108          1

In [13]:
from models.sales import Sale
# "customer_id", "product_id","sale_date", "quantity", "total"
Sale.insert(
    customer_id=1,
    product_id=8,
    sale_date="2025-06-26",
    quantity=5,
    total=225
)

Sale inserted successfully.

In [14]:
from utils.postgres_utils import run_query

query ="""SELECT * FROM products"""

print("Select after sale to check stock ")

run_query(query=query)

Select after sale to check stock

    id        name     category  price  stock  branch_id
0   12  Producto B  Categoria 2  15.49     50          2
1   14  Producto D  Categoria 3  12.99     75          3
2   15  Producto E  Categoria 2   9.49    120          2
3   17  Producto G  Categoria 3  11.49     60          3
4   18  Producto H  Categoria 2   8.99     90          2
5   20  Producto J  Categoria 3  16.99     40          3
6    2  Producto B  Categoria 2  15.49     49          2
7    4  Producto D  Categoria 3  12.99     74          3
8    5  Producto E  Categoria 2   9.49    116          2
9    7  Producto G  Categoria 3  11.49     59          3
10  10  Producto J  Categoria 3  16.99     37          3
11  11  Producto A  Categoria 1  12.09    100          1
12  13  Producto C  Categoria 1   8.79    200          1
13  16  Producto F  Categoria 1  16.49     80          1
14  19  Producto I  Categoria 1  14.84    110          1
15   1  Producto A  Categoria 1  16.09     98          1
16   3  Producto C  Categoria 1  11.70    197          1
17   6  Producto F  Categoria 1  21.95     78          1
18   9  Producto I  Categoria 1  19.75    108          1
19   8  Producto H  Categoria 2   8.99     65          2

In [15]:

from models.sales_procedure import SalesProcedure
SalesProcedure.create_sale_procedure()

[SalesProcedure] Sale procedure created successfully.

In [ ]:
SalesProcedure.call_sale_procedure(
    customer_id=1,
    product_id=8,
    sale_date="2025-06-26",
    quantity=5,
)

# HW 6
## Documentación
* Exportar el esquema de la base de datos con pg_dump.

.[`schema`](./schema.sql)

* Incluir un archivo .sql con todas las consultas realizadas.

.[`queries realizadas`](./answers.sql)